[
    [
        "Hi there!",
        "Hello! How can I assist you today?"
    ],
    [
        "What's your name?",
        "I am ZikoChatBot, your virtual assistant."
    ],
    [
        "What can you do?",
        "I can chat with you and help answer your questions."
    ],
    [
        "Can you tell me a joke?",
        "Why don't scientists trust atoms? Because they make up everything!"
    ],
    [
        "Goodbye",
        "Goodbye! Have a great day!"
    ],
    [
        "How are you?",
        "I am good.",
        "That is good to hear.",
        "Thank you",
        "You're welcome."
    ],
    [
        "What is the capital of France?",
        "The capital of France is Paris."
    ],
    [
        "Who is the president of the United States?",
        "The current president of the United States is Joe Biden."
    ],
    [
        "Tell me a fun fact.",
        "Did you know that honey never spoils? Archaeologists have found pots of honey in ancient Egyptian tombs that are over 3000 years old and still edible."
    ],
    [
        "What is the weather like today?",
        "I'm sorry, I can't check the weather right now. Please try asking your local weather service."
    ],
    [
        "What is the largest mammal?",
        "The blue whale is the largest mammal on Earth."
    ],
    [
        "How do you make a pizza?",
        "To make a pizza, you need dough, tomato sauce, cheese, and your choice of toppings. Bake it in an oven at 475°F for about 10-15 minutes."
    ],
    [
        "What is the speed of light?",
        "The speed of light is approximately 299,792 kilometers per second (186,282 miles per second)."
    ],
    [
        "Who wrote 'Pride and Prejudice'?",
        "'Pride and Prejudice' was written by Jane Austen."
    ],
    [
        "What is the tallest mountain in the world?",
        "Mount Everest is the tallest mountain in the world, standing at 8,848 meters (29,029 feet) above sea level."
    ],
    [
        "How do you boil an egg?",
        "To boil an egg, place it in a pot of boiling water and cook for about 7-10 minutes, depending on how well-cooked you like your eggs."
    ],
    [
        "What is the capital of Japan?",
        "The capital of Japan is Tokyo."
    ],
    [
        "Who invented the telephone?",
        "The telephone was invented by Alexander Graham Bell in 1876."
    ],
    [
        "What is the meaning of life?",
        "The meaning of life is a philosophical question and can vary depending on individual beliefs and perspectives."
    ],
    [
        "How far is the Moon from the Earth?",
        "The average distance from the Earth to the Moon is about 384,400 kilometers (238,855 miles)."
    ],
    [
        "What is the boiling point of water?",
        "The boiling point of water is 100°C (212°F) at sea level."
    ],
    [
        "How many continents are there?",
        "There are seven continents: Africa, Antarctica, Asia, Europe, North America, Australia, and South America."
    ],
    [
        "Who painted the Mona Lisa?",
        "The Mona Lisa was painted by Leonardo da Vinci."
    ],
    [
        "What is the smallest country in the world?",
        "Vatican City is the smallest country in the world, with an area of about 44 hectares (110 acres)."
    ],
    [
        "What is the currency of Japan?",
        "The currency of Japan is the Japanese Yen."
    ],
    [
        "How many bones are in the human body?",
        "An adult human has 206 bones in their body."
    ],
    [
        "What is the largest ocean?",
        "The Pacific Ocean is the largest ocean on Earth."
    ],
    [
        "Who discovered penicillin?",
        "Penicillin was discovered by Alexander Fleming in 1928."
    ],
    [
        "What is the Great Wall of China?",
        "The Great Wall of China is a series of fortifications built to protect China from invasions. It is over 13,000 miles long."
    ],
    [
        "What is the function of the heart?",
        "The heart pumps blood throughout the body, supplying oxygen and nutrients to tissues and removing carbon dioxide and other wastes."
    ],
    [
        "What is photosynthesis?",
        "Photosynthesis is the process by which green plants use sunlight to synthesize foods from carbon dioxide and water."
    ],
    [
        "How many planets are in the Solar System?",
        "There are eight planets in the Solar System: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune."
    ],
    [
        "What is the tallest building in the world?",
        "As of now, the Burj Khalifa in Dubai is the tallest building in the world, standing at 828 meters (2,717 feet)."
    ],
    [
        "What is the formula for water?",
        "The chemical formula for water is H2O, which means it is made up of two hydrogen atoms and one oxygen atom."
    ],
    [
        "Who was the first person to walk on the Moon?",
        "Neil Armstrong was the first person to walk on the Moon, on July 20, 1969."
    ],
    [
        "What is the capital of Italy?",
        "The capital of Italy is Rome."
    ],
    [
        "What are the three states of matter?",
        "The three states of matter are solid, liquid, and gas."
    ],
    [
        "How do plants reproduce?",
        "Plants can reproduce through various methods, including seeds, spores, and vegetative reproduction (such as cuttings and runners)."
    ],
    [
        "What is the chemical symbol for gold?",
        "The chemical symbol for gold is Au."
    ],
    [
        "What is a black hole?",
        "A black hole is a region of space where the gravitational pull is so strong that not even light can escape from it."
    ],
    [
        "How many seasons are there in a year?",
        "There are four seasons in a year: spring, summer, autumn (fall), and winter."
    ],
    [
        "What is the largest desert in the world?",
        "The Sahara Desert in Africa is the largest hot desert in the world, and Antarctica is the largest cold desert."
    ],
    [
        "Who wrote 'To Kill a Mockingbird'?",
        "'To Kill a Mockingbird' was written by Harper Lee."
    ],
    [
        "What is the freezing point of water?",
        "The freezing point of water is 0°C (32°F) at sea level."
    ],
    [
        "What is the human genome?",
        "The human genome is the complete set of genetic information for humans, encoded in DNA."
    ],
    [
        "How does gravity work?",
        "Gravity is the force that attracts two bodies towards each other. The force depends on the mass of the bodies and the distance between them."
    ],
    [
        "What is the capital of Canada?",
        "The capital of Canada is Ottawa."
    ],
    [
        "Who was Albert Einstein?",
        "Albert Einstein was a theoretical physicist who developed the theory of relativity and won the Nobel Prize in Physics in 1921."
    ],
    [
        "What is the primary function of the lungs?",
        "The primary function of the lungs is to exchange oxygen and carbon dioxide between the air and the blood."
    ],
    [
        "What is the speed of sound?",
        "The speed of sound is approximately 343 meters per second (1,125 feet per second) in air at room temperature."
    ],
    [
        "Who wrote '1984'?",
        "'1984' was written by George Orwell."
    ],
    [
        "What is the tallest waterfall in the world?",
        "Angel Falls in Venezuela is the tallest waterfall in the world, with a height of 979 meters (3,212 feet)."
    ]
]